{
    "socialLinks": {
        "github": "https://github.com/Jyoti-Tiwari22",
        "linkedin": "https://www.linkedin.com/in/jyoti-tiwari-a242471aa"
    },
    "aboutInfo": {
        "name": "Jyoti Tewari",
        "degree": "Post-Graduate",
        "university": "Dev Bhoomi",
        "bachelorDegree": "Computer Application",
        "bachelorUniversity": "Guru Jambheshwar University, Hisar",
        "experience": " 3 years",
        "familyMembers": 4
    },
    "skills": [
      {
        "name": "Html",
        "percentage": 90
      },
      {
        "name": "CSS",
        "percentage": 90
      },
      {
        "name": "Bootstrap",
        "percentage": 90
      },
      {
        "name": "TailwindCSS",
        "percentage": 90
      },
      {
        "name": "JavaScript",
        "percentage": 70
      },
      {
        "name": "ReactJs",
        "percentage": 70
      },
      {
        "name": "ReactNative",
        "percentage": 70
      },
      {
        "name": "Golang",
        "percentage": 60
      },
      {
        "name": "MySql",
        "percentage": 60
      },
      {
        "name": "NextJs",
        "percentage": 50
      }
    ],
    "experience": [
      {
        "position": "Front-end Developer",
        "company": "MossPark",
        "startDate": "01/7/2024",
        "endDate": "01/11/2024",
        "description": "At MossPark, worked on the development of a Single Page Application (SPA) for Collision Conf 2024, focusing on delivering a dynamic, high-performance, and user-friendly interface. Designed an engaging landing page to clearly communicate MossPark's value proposition and attract more users. Additionally, contributed to the development of LumeDot's web and mobile app using React Native, enabling users to read and listen to audiobooks. Integrated CI/CD pipelines to automate deployment and ensure smooth updates, improving development efficiency and reducing downtime."
      },
      {
        "position": "Full-Stack Developer",
        "company": "SAS Proaplicaciones",
        "startDate": "01/12/2021",
        "endDate": "30/12/2024",
        "description": "At Sas Proaplicaciones, worked on multiple projects involving full-stack development using Golang, React.js, Hugo, and MySQL/Postgres to build scalable and efficient web applications. One of the key projects was the development of a stock donation platform, where Golang was used for backend API development and React.js for frontend design. The platform featured user-friendly interfaces for stock selection, transaction preferences, and real-time stock valuation. It also incorporated secure user authentication, data encryption, and seamless communication with financial APIs, ensuring safe and efficient transactions. Additionally, developed a chatbot for Donorbox using OpenAI API, which was trained on the organization's internal database to provide real-time donation-related assistance. The chatbot was designed to retrieve data from database tables dynamically, improving donor engagement and customer interactions. Another major contribution was designing and developing a dynamic content management system (CMS) using Golang and Hugo, enabling automated static site generation from structured data. Developed RESTful APIs in Golang to fetch and process MySQL database records, dynamically populating Hugo-compatible markdown (.md) files for content generation. Structured Golang structs were implemented to map database records for pages like About, Services, and Contact, ensuring scalability and easy content updates. Automated content deployment using Hugo templates, optimizing site performance and reducing manual updates."
      },
      {
        "position": "Front-end Developer",
        "company": "Tutree, India",
        "startDate": "01/04/2020",
        "endDate": "30/11/2020",
        "description": "Creating new features, functionality, and capability on the sites using HTML, CSS, JavaScript, and Bootstrap. Implemented websites, mobile applications, and landing pages from concept through deployment."
      },
      {
        "position": "Intern Front-end Developer",
        "company": "Tutree, India",
        "startDate": "01/01/2020",
        "endDate": "30/11/2020",
        "description": "Worked as an Intern and implemented a new responsive, mobile-first approach which increased mobile traffic by 20%."
      },
      {
        "position": "Intern Front-end Developer",
        "company": "Henry harvin education, India",
        "startDate": "27/09/2019",
        "endDate": "27/12/2019",
        "description": "Collaborated with product team members to implement new feature developments."
      }
    ],
    "education": [
        {
            "degree": "Master in Computer Application",
            "university": "Dev Bhoomi Group Of Institutions And Technology",
            "startDate": "2020",
            "endDate": "2022",
            "description": "Web Technology, Python, C"
        },
        {
            "degree": "Bachelor of Computer Application",
            "university": "Guru Jambheshwar University, Hisar, India",
            "startDate": "2016",
            "endDate": "2019",
            "description": "Computer Fundamentals, Database Management Systems, Object-Oriented Programming, Operating System"
        },
        {
            "degree": "Diploma In Management And Technology (DMIT)",
            "university": "International Institute Of Management, Media And IT",
            "startDate": "2017",
            "endDate": "2020"
        },
        {
            "degree": "12th",
            "university": "Government Inter College Chaukhutia, Almora, Uttrakhand, India",
            "startDate": "2014",
            "endDate": "2015"
        },
        {
            "degree": "10th",
            "university": "DDC Memorial Public School Dhikuli, Ramnagar Nanital",
            "startDate": "2012",
            "endDate": "2013"
        }
    ]
}